src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеМПЗПрочее/ПоступлениеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonForms/ОформлениеНедостачиИзлишков/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидОперации = Параметры.ВидОперации;
	Если ВидОперации = 1 Тогда
	Элементы.Оформить.Заголовок = "Оформить недостачу";
	Иначе	
	Элементы.Оформить.Заголовок = "Оформить излишки";	
	КонецЕсли;
		Если Параметры.Свойство("ПЗ") Тогда
		ПроизводственноеЗадание = Параметры.ПЗ;
		КонецЕсли;  
МестоХраненияКанбанов = Параметры.МестоХраненияКанбанов;
МПЗ = Параметры.МПЗ;
ЕдиницаИзмерения = МПЗ.ЕдиницаИзмерения;
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ТекВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	ИначеЕсли ТипЗнч(МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
	ТекВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	КонецЕсли;
КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияКанбанов,МПЗ);
//КоличествоНаСкладе = КоличествоНаСкладе + ОбщийМодульРаботаСРегистрами.ПолучитьОстатокВПроизводстве(Линейка,МПЗ);                                                                                           
КонецПроцедуры

&НаСервере
Функция ОформитьНедостачуНаСервере()
	Если КоличествоФактическое > КоличествоНаСкладе Тогда
	Сообщить("Фактическое количество должно быть меньше количества на складе "+МПЗ+"!");
	Возврат(Неопределено);				
	КонецЕсли; 
		Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТекВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		МестоХранения = Константы.МестоХраненияНедостачиМатериалов.Получить();
		ИначеЕсли ТипЗнч(МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТекВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		МестоХранения = МПЗ.Канбан.МестоХраненияСписанияНедостачи;
		КонецЕсли; 
			Попытка
			НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
			Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
			Перемещение.ДокументОснование = ПроизводственноеЗадание;
			Перемещение.Дата = ТекущаяДата();
			Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(МестоХраненияКанбанов.Подразделение));
			Перемещение.Автор = ПараметрыСеанса.Пользователь;
			Перемещение.Подразделение = МестоХраненияКанбанов.Подразделение;
			Перемещение.МестоХранения = МестоХраненияКанбанов;
			Перемещение.МестоХраненияВ = МестоХранения;
			Перемещение.Комментарий = "Недостача по месту хранения "+СокрЛП(МестоХраненияКанбанов.Наименование)+", автор "+ПараметрыСеанса.Пользователь;
			ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
			ТЧ.ВидМПЗ = ТекВидМПЗ;
			ТЧ.МПЗ = МПЗ;
			ТЧ.Количество = (КоличествоНаСкладе-КоличествоФактическое)/МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;
			ТЧ.ЕдиницаИзмерения =  МПЗ.ОсновнаяЕдиницаИзмерения;	
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
				Если КоличествоФактическое = 0 Тогда
				ОбщийМодульВызовСервера.ОстановитьМТК(ПроизводственноеЗадание.ДокументОснование,ПараметрыСеанса.Пользователь,"Отсутствие МПЗ в связи со списанием недостачи",МПЗ,Неопределено,ПолучитьТекущееРабочееМесто());
				//МТК = ПроизводственноеЗадание.ДокументОснование.ПолучитьОбъект();
				//МТК.МПЗОстановки = МПЗ;
				//МТК.ДатаНачалаОстановки = ТекущаяДата();
				//МТК.ДатаОкончанияОстановки = Дата(1,1,1);
				//МТК.ИнициаторОстановки = ПараметрыСеанса.Пользователь;
				//МТК.ПричинаОстановки = "Отсутствие МПЗ в связи со списанием недостачи";
				//МТК.Статус = 2;
				//МТК.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
			Возврат(Перемещение.Ссылка);
			Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Неопределено);
			КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьПользователя()
Возврат(ПараметрыСеанса.Пользователь);
КонецФункции

&НаСервере
Функция ПолучитьМТК()
Возврат(ПроизводственноеЗадание.ДокументОснование);
КонецФункции

&НаСервере
Функция ПолучитьТекущееРабочееМесто()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто КАК РабочееМесто
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = &ПЗ";
Запрос.УстановитьПараметр("ПЗ", ПроизводственноеЗадание);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.РабочееМесто);
	КонецЦикла;
Возврат(Справочники.РабочиеМестаЛинеек.ПустаяСсылка());
КонецФункции 

&НаКлиенте
Процедура ОформитьНедостачу(Команда)
	Если КоличествоНаСкладе > 0 Тогда
		Если (КоличествоНаСкладе-КоличествоФактическое) > 0 Тогда
		Результат = ОформитьНедостачуНаСервере();	
			Если Результат <> Неопределено Тогда
			ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
			Этаформа.Закрыть(Истина);
			КонецЕсли;		
		Иначе	
		Сообщить("Фактическое кол-во не может быть равно учётному кол-ву на складе.");
		Возврат;
		КонецЕсли; 	
	Иначе
		Если Вопрос("По учёту на складе нет выбранного МПЗ!
					|МТК будет остановлена. Получите следующее задание!", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК  Тогда
		ОбщийМодульВызовСервера.ОстановитьМТК(ПолучитьМТК(),ПолучитьПользователя(),"Фактическая недостача МПЗ",МПЗ,Неопределено,ПолучитьТекущееРабочееМесто());
		Этаформа.Закрыть(Истина);		
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ОформитьИзлишкиНаСервере()
	Если КоличествоФактическое <= КоличествоНаСкладе Тогда
	Сообщить("Фактическое количество должно быть больше количества на складе "+МПЗ+"!");
	Возврат(Неопределено);				
	КонецЕсли;
		Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТекВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		Статья = Константы.СтатьяПриходаИзлишковМатериалов.Получить();
		ИначеЕсли ТипЗнч(МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТекВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		Статья = МПЗ.Канбан.СтатьяПриходаИзлишков;
		КонецЕсли; 
			Попытка
			НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
			ПоступлениеПрочее = Документы.ПоступлениеМПЗПрочее.СоздатьДокумент();
			ПоступлениеПрочее.Дата = ТекущаяДата();
			ПоступлениеПрочее.Автор = ПараметрыСеанса.Пользователь;
			ПоступлениеПрочее.Подразделение = МестоХраненияКанбанов.Подразделение;
			ПоступлениеПрочее.МестоХранения = МестоХраненияКанбанов;
			ПоступлениеПрочее.Статья = Статья;
			ПоступлениеПрочее.УстановитьНовыйНомер(ПрисвоитьПрефикс(МестоХраненияКанбанов.Подразделение));
			ПоступлениеПрочее.Комментарий = "Приходование излишков на линейку";
			ТЧПП = ПоступлениеПрочее.ТабличнаяЧасть.Добавить();
			ТЧПП.ВидМПЗ = ТекВидМПЗ;
			ТЧПП.МПЗ = МПЗ;	
			ТЧПП.ЕдиницаИзмерения = МПЗ.ОсновнаяЕдиницаИзмерения;
			ТЧПП.Количество = (КоличествоФактическое-КоличествоНаСкладе)/МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;	
		    ПоступлениеПрочее.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
			Возврат(ПоступлениеПрочее.Ссылка);
			Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Неопределено);
			КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ОформитьИзлишки(Команда)
Результат = ОформитьИзлишкиНаСервере();	
	Если Результат <> Неопределено Тогда
	ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Создан документ "+Результат,БиблиотекаКартинок.Пользователь);
	Этаформа.Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Оформить(Команда)
	Если ВидОперации = 1 Тогда
	ОформитьНедостачу(Неопределено);
	Иначе
	ОформитьИзлишки(Неопределено);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
Этаформа.Закрыть(Ложь);
КонецПроцедуры
